const NumberOfMonths = {
	he: {
		0: 'ינואר',
		1: 'פברואר',
		2: 'מרץ',
		3: 'אפריל',
		4: 'מאי',
		5: 'יוני',
		6: 'יולי',
		7: 'אוגוסט',
		8: 'ספטמבר',
		9: 'אוקטובר',
		10: 'נובמבר',
		11: 'דצמבר',
	},
	en: {
		0: 'January',
		1: 'February',
		2: 'March',
		3: 'April',
		4: 'May',
		5: 'June',
		6: 'July',
		7: 'August',
		8: 'September',
		9: 'October',
		10: 'Novemver',
		11: 'December',
	},
	ru: {
		0: 'январь',
		1: 'февраль',
		2: 'март',
		3: 'апрель',
		4: 'май',
		5: 'июнь',
		6: 'июль',
		7: 'август',
		8: 'сентябрь',
		9: 'октябрь',
		10: 'ноябрь',
		11: 'декабрь',
	},
};

const ArrayOfMonths = {
	he: [
		['ינואר', 'פברואר', 'מרץ'],
		['אפריל', 'מאי', 'יוני'],
		['יולי', 'אוגוסט', 'ספטמבר'],
		['אוקטובר', 'נובמבר', 'דצמבר'],
	],
	en: [
		['January', 'February', 'March'],
		['April', 'May', 'June'],
		['July', 'August', 'September'],
		['October', 'Novemver', 'December'],
	],
	ru: [
		['январь', 'февраль', 'март'],
		['апрель', 'май', 'июнь'],
		['июль', 'август', 'сентябрь'],
		['октябрь', 'ноябрь', 'декабрь'],
	],
};

const NameOfMonths = {
	en: ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'Novemver', 'December'],
	he: ['ינואר', 'פברואר', 'מרץ', 'אפריל', 'מאי', 'יוני', 'יולי', 'אוגוסט', 'ספטמבר', 'אוקטובר', 'נובמבר', 'דצמבר'],
	ru: ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь', 'декабрь'],
};

const DayOfWeeks = {
	he: ['א', 'ב', 'ג', 'ד', 'ה', 'ו', 'ז'],
	en: ['S', 'M', 'T', 'W', 'T', 'F', 'S'],
	ru: ['П', 'В', 'С', 'Ч', 'П', 'С', 'В'],
};

export { NameOfMonths, ArrayOfMonths, NumberOfMonths, DayOfWeeks };
